
&НаКлиенте
Процедура Тест(Команда)
	Если МассивОбъектов.Количество() > 0 Тогда
		СоответствиеТаблДокументов = Новый Соответствие;
		ВызватьПолучениеТабДок(СоответствиеТаблДокументов);	

		// выводим окна с табличными документами
		Для Каждого ЭлементСоответствия Из СоответствиеТаблДокументов Цикл
			ЭлементСоответствия.Значение.Показать(ЭлементСоответствия.Ключ);
		КонецЦикла; 
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одного тестового объекта";
		Сообщение.Сообщить();
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ВызватьПолучениеТабДок(СоответствиеТаблДокументов)

	ИдентификаторКоманды = "ДС3_СписокПеречисляемойЗарплаты"; 
	// тот же - что и в функ "СведенияОВнешнейОбработке" модуля обработки!
	ОбъектОбр = РеквизитФормыВЗначение("Объект");
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ИдентификаторКоманды);
	ОбъектыПечати =  Новый СписокЗначений;
		
	Масс = Новый Массив;
	Для Каждого ЭлмСписка Из МассивОбъектов Цикл 
	     Масс.Добавить(ЭлмСписка.Значение);
	КонецЦикла; 
	
	ОбъектОбр.Печать(Масс,
		КоллекцияПечатныхФорм, ОбъектыПечати, Новый  Структура("ДоступнаПечатьПоКомплектно", Ложь));
	// подготовим визуализацию полученных печатных форм
	Для Каждого ТекПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
	       СоответствиеТаблДокументов.Вставить(ТекПечатнаяФорма.ИмяМакета,
		   ТекПечатнаяФорма.ТабличныйДокумент);
	КонецЦикла; 
	
КонецПроцедуры // ВызватьПолучениеТабДок()
